irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_iwdg_3843_IUT.c
CS_CMM_PROBE_NODE_STMT(135,2,1) 
 CODESCROLL_FUNC_END(224, 15, 116) } CODESCROLL_FUNC_END_RBRACE 







void IWDG_SetReload(uint16_t Reload)
{ CODESCROLL_FUNC_BEGIN(225, (225, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable633,620) 

  
  CS_CMM_PROBE_NODE_STMT(135,1,0) ((void)0);
  ((IWDG_TypeDef *) (((uint32_t)0x40000000) + 0x3000))->RLR = Reload;

CS_CMM_PROBE_NODE_STMT(135,0,1) 
 CODESCROLL_FUNC_END(225, 15, 129) } CODESCROLL_FUNC_END_RBRACE 







void IWDG_ReloadCounter(void)
{ CODESCROLL_FUNC_BEGIN(226, (226, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable634,621) 
  
  CS_CMM_PROBE_NODE_STMT(136,7,0) ((IWDG_TypeDef *) (((uint32_t)0x40000000) + 0x3000))->KR = ((uint16_t)0xAAAA);

CS_CMM_PROBE_NODE_STMT(136,6,1) 
 CODESCROLL_FUNC_END(226, 15, 140) } CODESCROLL_FUNC_END_RBRACE 






void IWDG_Enable(void)
{ CODESCROLL_FUNC_BEGIN(227, (227, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable635,622) 
  
  CS_CMM_PROBE_NODE_STMT(136,5,0) ((IWDG_TypeDef *) (((uint32_t)0x40000000) + 0x3000))->KR = ((uint16_t)0xCCCC);

CS_CMM_PROBE_NODE_STMT(136,4,1) 
 CODESCROLL_FUNC_END(227, 15, 150) } CODESCROLL_FUNC_END_RBRACE 
/* # 160 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_iwdg.c"*/
FlagStatus IWDG_GetFlagStatus(uint16_t IWDG_FLAG)
{ CODESCROLL_FUNC_BEGIN(228, (228, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable636,623) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable637,136,3,0)

  FlagStatus bitstatus = RESET;

  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(136,2,1) if ((((IWDG_TypeDef *) (((uint32_t)0x40000000) + 0x3000))->SR & IWDG_FLAG) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable638,624) 
    
    CS_CMM_PROBE_NODE_STMT(136,1,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable639,625) 
    
    CS_CMM_PROBE_NODE_STMT(136,0,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(137,7,4) 
   CODESCROLL_FUNC_END(228, 15, 174) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
